# StandardHookBendDiameterTooSmall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..StandardHookBendDiameterTooSmall Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Standard Hook Bend Diameter is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StandardHookBendDiameterTooSmall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StandardHookBendDiameterTooSmall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StandardHookBendDiameterTooSmall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace